#+title: README

A  [[https://github.com/doomemacs/doomemacs][Doom Emacs]] centered dotfiles repository.

‼ It is probably best to view this file in emacs.  Github's rendering of org files appears to be incomplete.

* Requirements
While I doubt that this will end up deep enough into the weeds that portability will become a problem, my personal environment sits atop [[https://voidlinux.org][Void Linux]].

The following packages are installed:
#+begin_src shell
xbps-query --list-manual-pkgs
#+end_src

#+RESULTS:
| acpi_call-dkms-1.2.2_1            |
| alsa-plugins-pulseaudio-1.2.7.1_1 |
| aspell-0.60.8_5                   |
| aspell-en-2020.12.07_2            |
| base-system-0.114_1               |
| cmake-3.24.3_1                    |
| cryptsetup-2.5.0_1                |
| ctags-5.9.20221002.0_1            |
| curl-7.86.0_1                     |
| dejavu-fonts-ttf-2.37_2           |
| emacs-gtk3-28.2_1                 |
| exercism-3.0.13_1                 |
| fd-8.5.3_1                        |
| firefox-107.0_1                   |
| font-misc-misc-1.1.2_7            |
| font-mplus-ttf-063a_2             |
| git-2.38.1_1                      |
| gnome-icon-theme-3.12.0_3         |
| gnome-keyring-42.1_1              |
| gnome-themes-standard-3.28_3      |
| go-1.19.2_1                       |
| grub-i386-efi-2.06_2              |
| grub-x86_64-efi-2.06_2            |
| gvfs-afc-1.50.2_1                 |
| gvfs-mtp-1.50.2_1                 |
| gvfs-smb-1.50.2_1                 |
| libX11-devel-1.8.2_1              |
| libtool-2.4.7_1                   |
| libvterm-0.3_1                    |
| lvm2-2.02.187_2                   |
| mdadm-4.2_1                       |
| mozc-2.28.4800.102_1              |
| network-manager-applet-1.30.0_1   |
| nkf-2.1.5_1                       |
| pa-applet-0.0.0.20140304_2        |
| pamixer-1.6_1                     |
| pkg-config-0.29.2_3               |
| powertop-2.14_1                   |
| ripgrep-13.0.0_1                  |
| setxkbmap-1.3.3_1                 |
| slock-1.4_1                       |
| terminus-font-4.49.1_1            |
| tlp-1.5.0_2                       |
| tmux-3.3a_1                       |
| tpacpi-bat-3.1_2                  |
| udisks2-2.9.4_1                   |
| unzip-6.0_14                      |
| void-docs-browse-2021.10.06_1     |
| wget-1.21.3_1                     |
| xauth-1.1.2_1                     |
| xautolock-2.2_7                   |
| xorg-input-drivers-7.6_4          |
| xorg-minimal-1.2_2                |
| xorg-video-drivers-7.6_22         |
| xprop-1.2.5_1                     |
